src/cf/Reports/PollStatistics.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>PollStatistics</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/QuestionnaireQuestionAnswers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>QuestionnaireQuestionAnswers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Response</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OpenAnswer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Questionnaire</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Questionnaire</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Question</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ElementaryQuestion</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CellNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/TabularQuestionTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>TabularQuestionTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Composite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PredefinedAnswersInRows</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PredefinedAnswersInColumns</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PredefinedAnswersInRowsAndColumns</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Questionnaire.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Questionnaire</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.QuestionnaireQuestionAnswers</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Survey</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PollPurpose</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Respondent</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Respondent</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SectionToEdit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Interviewer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Interviewer</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuestionnaireTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SurveyMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SurveyModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Question</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CellNumber</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Response</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OpenAnswer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/QuestionsForSurvey.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>QuestionsForSurvey</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.QuestionnaireAnswersOptions</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Wording</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionAnswerTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommentRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommentNote</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoFill</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Length</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MinValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Accuracy</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowAggregatedValuesInReports</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RadioButtonType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RadioButtonTypesInQuestionnaires</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckBoxType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CheckBoxKindsInQuestionnaires</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/Reports/PollStatistics/Forms/TableQuestionsDetails/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	BasicQuestionsFormulations = New Map;
	
	If  ProcessIncomingParameters(BasicQuestionsFormulations) Then
		Cancel = True;
		Return;
	EndIf;
	
	GenerateReport(BasicQuestionsFormulations);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure GenerateReport(BasicQuestionsFormulations)

	ReportTable.Clear();
	
	QueryResult = ExecuteQueryOnQuestionnareQuestion();
	If QueryResult.IsEmpty() Then
		Return;
	EndIf;
	
	Template = Reports.PollStatistics.GetTemplate("AnswersTemplate");
	
	Area = Template.GetArea("Question");
	Area.Parameters.QuestionWording = Wording;
	ReportTable.Put(Area,1);
	
	AnswersTree = QueryResult.Unload(QueryResultIteration.ByGroups);
	For each TreeRow In AnswersTree.Rows Do
		OutputToRespondentsDocument(TreeRow,Template,BasicQuestionsFormulations);
	EndDo;

EndProcedure

&AtServer
Procedure OutputToRespondentsDocument(TreeRow,Template, BasicQuestionsFormulations)

	Area = Template.GetArea("Respondent");
	Area.Parameters.Respondent = TreeRow.Respondent;
	ReportTable.Put(Area,1);
	
	ReportTable.StartRowGroup(TreeRow.Respondent);
	OutputTabularAnswer(TreeRow,Template,BasicQuestionsFormulations);
	ReportTable.EndRowGroup();

EndProcedure

&AtServer
Procedure OutputTabularAnswer(TreeRow,Template,BasicQuestionsFormulations)

	If TabularQuestionType = Enums.TabularQuestionTypes.Composite Then
		
		OutputAnswerCompositeTabularQuestion(TreeRow,Template,BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInColumns Then
		
		OutputAnswerPredefinedAnswersInColumnsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInRows Then
		
		OutputAnswerPredefinedAnswersInRowsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations);
		
	ElsIf TabularQuestionType = Enums.TabularQuestionTypes.PredefinedAnswersInRowsAndColumns Then
		
		OutputAnswerPredefinedAnswersInRowsAndColumnsTabularQuestion(TreeRow,Template);
		
	EndIf;

EndProcedure

&AtServer
Procedure OutputAnswerCompositeTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)
	
	FirstColumn = True;
	
	For each Question In TabularQuestionComposition Do
		
		If FirstColumn Then
			Area = Template.GetArea("Indent");
			ReportTable.Put(Area);
			FirstColumn = False;
		EndIf;
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(Question.ElementaryQuestion);
		ReportTable.Join(Area);
		
	EndDo; 
	
	FirstColumn = True;
	
	For each TreeRowCell In TreeRow.Rows Do
		
		FirstColumn = True;
		
		For each TabularQuestionContentRow In TabularQuestionComposition Do
			
			FoundRow = TreeRowCell.Rows.Find(TabularQuestionContentRow.ElementaryQuestion,"ElementaryQuestion");
			
			If FirstColumn Then
				Area = Template.GetArea("Indent");
				ReportTable.Put(Area);
				FirstColumn = False;
			EndIf;
			
			Area = Template.GetArea("TableQuestionCell");
			Area.Parameters.Value = ?(FoundRow = Undefined,"",FoundRow.Response);
			ReportTable.Join(Area);
			
		EndDo;
		
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInColumnsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)

	Area = Template.GetArea("Indent");
	ReportTable.Put(Area);
	
	Area = Template.GetArea("TableQuestionHeaderItem");
	ReportTable.Join(Area);
	
	For Each Answer In PredefinedAnswers Do
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = Answer.Response;
		ReportTable.Join(Area);
		
	EndDo;	
	
	For RowsIndex = 2 To TabularQuestionComposition.Count() Do
		
		Area = Template.GetArea("Indent");
		ReportTable.Put(Area);
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(TabularQuestionComposition[RowsIndex - 1].ElementaryQuestion);
		ReportTable.Join(Area);
		
		For ColumnsIndex = 1 To PredefinedAnswers.Count() Do
			
			FilterStructure = New Structure;
			FilterStructure.Insert("ElementaryQuestion", TabularQuestionComposition[RowsIndex-1].ElementaryQuestion);
			FilterStructure.Insert("CellNumber",ColumnsIndex);
			FoundRows = TreeRow.Rows.FindRows(FilterStructure,True);
			
			Area = Template.GetArea("TableQuestionCell");
			If FoundRows.Count() > 0 Then
				Area.Parameters.Value = FoundRows[0].Response;
			EndIf;
			ReportTable.Join(Area);
			
		EndDo;
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInRowsTabularQuestion(TreeRow,Template, BasicQuestionsFormulations)

	FirstColumn = True;
	
	For each Question In TabularQuestionComposition Do
		
		If FirstColumn Then
			Area = Template.GetArea("Indent");
			ReportTable.Put(Area);
			FirstColumn = False;
		EndIf;
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = BasicQuestionsFormulations.Get(Question.ElementaryQuestion);
		ReportTable.Join(Area);
		
	EndDo;
	
	For each TreeRowCell In TreeRow.Rows Do
		
		FirstColumn = True;
		
		For ColumnsIndex = 1 To TabularQuestionComposition.Count() Do
			
			If FirstColumn Then
				
				Area = Template.GetArea("Indent");
				ReportTable.Put(Area);
				FirstColumn = False;
				
				Area = Template.GetArea("TableQuestionCellItemPredefinedAnswer");
				Area.Parameters.Value = PredefinedAnswers[TreeRowCell.CellNumber - 1].Response;
				ReportTable.Join(Area);
				
			Else
				
				FoundRow = TreeRowCell.Rows.Find(TabularQuestionComposition[ColumnsIndex - 1].ElementaryQuestion,"ElementaryQuestion");
				
				Area = Template.GetArea("TableQuestionCell");
				Area.Parameters.Value = ?(FoundRow = Undefined,"",FoundRow.Response);

				ReportTable.Join(Area);
				
			EndIf;
			
		EndDo;
	EndDo;
	
EndProcedure

&AtServer
Procedure OutputAnswerPredefinedAnswersInRowsAndColumnsTabularQuestion(TreeRow,Template)
	
	ColumnsAnswers = PredefinedAnswers.FindRows(New Structure("ElementaryQuestion",TabularQuestionComposition[1].ElementaryQuestion));
	RowsAnswers = PredefinedAnswers.FindRows(New Structure("ElementaryQuestion",TabularQuestionComposition[0].ElementaryQuestion));
	
	If ColumnsAnswers.Count() = 0 AND RowsAnswers.Count() = 0 Then
		Return;
	EndIf;
	
	Area = Template.GetArea("Indent");
	ReportTable.Put(Area);
	
	Area = Template.GetArea("TableQuestionHeaderItem");
	ReportTable.Join(Area);
	
	For Each Answer In ColumnsAnswers Do
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = Answer.Response;
		ReportTable.Join(Area);
		
	EndDo;
	
	For RowIndex = 1 To RowsAnswers.Count()  Do
		
		Area = Template.GetArea("Indent");
		ReportTable.Put(Area);
		
		Area = Template.GetArea("TableQuestionHeaderItem");
		Area.Parameters.Value = RowsAnswers[RowIndex - 1].Response;
		ReportTable.Join(Area);
		
		For ColumnIndex = 1 To ColumnsAnswers.Count() Do
			
			FilterStructure = New Structure;
			FilterStructure.Insert("CellNumber", ColumnIndex + (RowIndex-1) * ColumnsAnswers.Count());
			FilterStructure.Insert("ElementaryQuestion",TabularQuestionComposition[2].ElementaryQuestion);
			FoundRows = TreeRow.Rows.FindRows(FilterStructure,True);
			
			Area = Template.GetArea("TableQuestionCell");
			If FoundRows.Count() > 0 Then
				Area.Parameters.Value = FoundRows[0].Response;
			EndIf;
			ReportTable.Join(Area);
			
		EndDo;
		
	EndDo;
	
EndProcedure

&AtServer
Function ExecuteQueryOnQuestionnareQuestion()
	
	Query = New Query;
	Query.Text = "
	|SELECT
	|	ISNULL(DocumentQuestionnaire.Respondent, UNDEFINED) AS Respondent,
	|	QuestionnaireQuestionAnswers.CellNumber                  AS CellNumber,
	|	QuestionnaireQuestionAnswers.ElementaryQuestion           AS ElementaryQuestion,
	|	QuestionnaireQuestionAnswers.Response
	|FROM
	|	InformationRegister.QuestionnaireQuestionAnswers AS QuestionnaireQuestionAnswers
	|		LEFT JOIN Document.Questionnaire AS DocumentQuestionnaire
	|		ON QuestionnaireQuestionAnswers.Questionnaire = DocumentQuestionnaire.Ref
	|WHERE
	|	QuestionnaireQuestionAnswers.Question = &TemplateQuestion
	|	AND DocumentQuestionnaire.Survey = &Survey
	|
	|ORDER BY
	|	Respondent,
	|	CellNumber
	|TOTALS BY
	|	Respondent,
	|	CellNumber";
	
	Query.SetParameter("TemplateQuestion",QuestionnaireTemplateQuestion);
	Query.SetParameter("Survey",Survey);
	
	Return Query.Execute();
	
EndFunction

&AtServer
Function ProcessIncomingParameters(BasicQuestionsFormulations)

	If Parameters.Property("QuestionnaireTemplateQuestion") Then
		QuestionnaireTemplateQuestion = Parameters.QuestionnaireTemplateQuestion;
	Else
		Return True;
	EndIf;
	
	If Parameters.Property("Survey") Then
		Survey = Parameters.Survey; 
	Else
		Return True;
	EndIf;
	
	If Parameters.Property("FullCode") Then
		FullCode =  Parameters.FullCode;
	EndIf;
	
	If Parameters.Property("SurveyDescription") Then
		SurveyDescription =  Parameters.SurveyDescription;
	Else
		Cancel = True;
	EndIf; 
	
	If Parameters.Property("SurveyDate") Then
		SurveyDate =  Parameters.SurveyDate;
	Else
		Cancel = True;
	EndIf;
	
	TemplateQuestionsAttributes = Common.ObjectAttributesValues(QuestionnaireTemplateQuestion,"TabularQuestionType,TabularQuestionComposition,PredefinedAnswers,Wording");
	Wording           = TemplateQuestionsAttributes.Wording;
	TabularQuestionType   = TemplateQuestionsAttributes.TabularQuestionType;
	TabularQuestionComposition.Load(TemplateQuestionsAttributes.TabularQuestionComposition.Unload());
	PredefinedAnswers.Load(TemplateQuestionsAttributes.PredefinedAnswers.Unload());
	GetBasicQuestionsFormulations(BasicQuestionsFormulations);
	
	Title = NStr("ru='Ответы на вопрос №'; en = 'Responses to question No.'; pl = 'Responses to question No.';de = 'Responses to question No.';ro = 'Responses to question No.';tr = 'Responses to question No.'; es_ES = 'Responses to question No.'") + " " + FullCode + " " + NStr("ru='опроса'; en = 'of survey'; pl = 'of survey';de = 'of survey';ro = 'of survey';tr = 'of survey'; es_ES = 'of survey'") + " " + SurveyDescription + " " + NStr("ru='от'; en = 'dated'; pl = 'dated';de = 'dated';ro = 'dated';tr = 'dated'; es_ES = 'dated'") + " " + Format(SurveyDate,"DLF=D");
	
	Return False;

EndFunction

&AtServer
Procedure GetBasicQuestionsFormulations(BasicQuestionsFormulations)
	
	Query = New Query;
	Query.Text = "SELECT
	|	QuestionsForSurvey.Ref,
	|	QuestionsForSurvey.Wording,
	|	QuestionsForSurvey.ShowAggregatedValuesInReports
	|FROM
	|	ChartOfCharacteristicTypes.QuestionsForSurvey AS QuestionsForSurvey
	|WHERE
	|	QuestionsForSurvey.Ref IN(&QuestionArray)";
	
	Query.SetParameter("QuestionArray",TabularQuestionComposition.Unload().UnloadColumn("ElementaryQuestion"));
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		BasicQuestionsFormulations.Insert(Selection.Ref,Selection.Wording);
	EndDo;
	
EndProcedure

#EndRegion
